In [17]:
import pandas as pd

In [18]:
from pandas import Series

In [21]:
se=Series([12,13,14,15],index=["a","b","c","d"])

In [22]:
se

a    12
b    13
c    14
d    15
dtype: int64

In [ ]:
#introduction to dataframe

In [24]:
data={"Name":['anu',"ammu","ramen"],
     "Age":[12,13,14],
     "Salary":[100,200,300]}

In [25]:
frame=pd.DataFrame(data)

In [26]:
frame

    Name  Age  Salary
0    anu   12     100
1   ammu   13     200
2  ramen   14     300

In [27]:
dict1={"test1":12,"test2":13,"test3":14}

In [28]:
dict1

{'test1': 12, 'test2': 13, 'test3': 14}

In [29]:
se2=Series(dict1)

In [30]:
se2

test1    12
test2    13
test3    14
dtype: int64

In [35]:
frame=pd.DataFrame(data,columns=["Age","Name",'Salary',"profile"])

In [36]:
frame

   Age   Name  Salary profile
0   12    anu     100     NaN
1   13   ammu     200     NaN
2   14  ramen     300     NaN

In [38]:
frame['Salary']

0    100
1    200
2    300
Name: Salary, dtype: int64

In [44]:
frame.iloc[1]

Age          13
Name       ammu
Salary      200
profile     NaN
Name: 1, dtype: object

In [45]:
frame

   Age   Name  Salary profile
0   12    anu     100     NaN
1   13   ammu     200     NaN
2   14  ramen     300     NaN

In [46]:
frame['profile']="doctor"

In [47]:
frame

   Age   Name  Salary profile
0   12    anu     100  doctor
1   13   ammu     200  doctor
2   14  ramen     300  doctor

In [48]:
frame["home"]="1bhk"

In [49]:
frame

   Age   Name  Salary profile  home
0   12    anu     100  doctor  1bhk
1   13   ammu     200  doctor  1bhk
2   14  ramen     300  doctor  1bhk

In [51]:
# frame.T

In [52]:
frame=frame.reindex([2,1,0])

In [53]:
frame

   Age   Name  Salary profile  home
2   14  ramen     300  doctor  1bhk
1   13   ammu     200  doctor  1bhk
0   12    anu     100  doctor  1bhk

In [54]:
fields=['Name','Salary','profile','home']

In [55]:
frame=frame.reindex(columns=fields)

In [56]:
frame

    Name  Salary profile  home
2  ramen     300  doctor  1bhk
1   ammu     200  doctor  1bhk
0    anu     100  doctor  1bhk

In [57]:
# frame2=frame.drop([2])

In [59]:
# frame2=frame.drop('Name',axis=1)

In [61]:
# frame2

In [62]:
frame

    Name  Salary profile  home
2  ramen     300  doctor  1bhk
1   ammu     200  doctor  1bhk
0    anu     100  doctor  1bhk

In [63]:
data1={"Name":['anu',"ammu","ramen"],
     "Age":[12,13,14],
     "Salary":[100,200,300]}

In [64]:
frame2=pd.DataFrame(data)

In [65]:
frame2

    Name  Age  Salary
0    anu   12     100
1   ammu   13     200
2  ramen   14     300

In [66]:
frame+frame2

   Age        Name  Salary  home  profile
0  NaN      anuanu     200   NaN      NaN
1  NaN    ammuammu     400   NaN      NaN
2  NaN  ramenramen     600   NaN      NaN

In [67]:
se=Series([12,13,14,15])
se2=Series([11,12,12,12])

In [68]:
se+se2

0    23
1    25
2    26
3    27
dtype: int64

In [75]:
# se=Series([12,13,14,15],index=["Age",'Salary',"profile"])

In [70]:
se

Age        12
Name       13
Salary     14
profile    15
dtype: int64

In [76]:
data4={"Name":[1,2,3],
     "Age":[12,13,14],
     "Salary":[100,200,300]}

In [77]:
frame4=pd.DataFrame(data4)

In [78]:
se+frame4

   Age  Name  Salary  profile
0   24    14     114      NaN
1   25    15     214      NaN
2   26    16     314      NaN